# # Задача No1. Решение в группах
# # За день машина проезжает n километров. Сколько дней нужно, чтобы проехать маршрут длиной m километров? При решении этой задачи нельзя пользоваться условной инструкцией if и циклами.
# # Input:
# # n = 700 m = 750 Output: 2

# n = int(input())
# m = int(input())
# d = (-m)//n
# print(-d)


# # Задача No3. Решение в группах
# # В некоторой школе решили набрать три новых математических класса и оборудовать кабинеты для них новыми партами. За каждой партой может сидеть два учащихся. Известно количество учащихся в каждом из трех классов. Выведите наименьшее число парт, которое нужно приобрести для них.
# # Input: 20 21 22(ввод чисел НЕ в одну строку) Output: 32

# n = int(input())
# m = int(input())
# c = int(input())
# n = (-n)//2
# m = (-m)//2
# c = (-c)//2
# d = m + c2 + n
# print(-d)

# # Напишите программу, которая принимает на вход координаты двух точек и находит
# # расстояние между ними в 2D пространстве

# a1 = int(input())
# b1 = int(input())
# a2 = int(input())
# b2 = int(input())

# result = ((a2 - a1) * (a2 - a1)) + (b2 - b1) * (b2 - b1)
# print(-d)




# i = int(input("Введите номер вагона согласно билету: "))
# j = int(input("Введите номер вагона, в котором вы оказались - "))

# if i == j:
#     print("Недостаточно информации")
# else:
#     print(f"количество вагонов = {i+j-1}")
